from PdfExtractor import *
from TextToEmbeddings import get_embeddings
from MyVectorDBConnector import *

if __name__ == "__main__":
    #paragraphs = extract_text_from_pdf("./docs/财务业务中台项目概况.pdf")

    vector_db = MyVectorDBConnector("rag_demo",get_embeddings)

    paragraphs = [
        '''1.1.3. 财务业务中台建设演进方式
依据国网企业中台总体规划建设路线，结合国网财务信息系统建设现状和实施难易程度，以智慧共享财务规划为导向，识别关键项目和任务，统筹考虑各任务的紧迫性、相关性、难易程度，明确财务业务中台三个阶段建设的演进方式。
1.第一阶段（2020年）：构建中台服务，沉淀共性能力
围绕财务专业管理需求，精准沉淀企业财务能力，将公司经营中价值管理所需的业务合规控制、数据标准管理、共性操作处理和经营数据应用沉淀提炼，形成财务中台服务中心及能力体系，为现有财务系统提供统一共享服务，实现财务能力的服务共享。现有财务系统做适应性改造，将财务中台共享服务已提供的功能从现有系统中剥离，改为从财务中台调用共享服务来实现。
2.第二阶段（2021年至2022年）：重构原有系统，建设智慧应用
从获得感、解耦难度、业务稳定性、系统影响等方面对现有财务系统进行评估，同时结合业务痛点、服务优先级等方面，梳理和明确财务系统重构升级路径，按解耦融入、优化改造、系统下线三种策略进行推进。按照“财务中台+智慧应用”的模式，从业财融合在线化、财务操作自动化和财务专业智慧化三个视角方面，将分散在不同系统的功能点重新组合，合理划分操作与管理边界，围绕业务场景，按流程操作与数据处理节点采用微服务架构重新设计、建设智慧应用，全面提升基层财务人员的交互体验，提高业务处理与数据查询效率。
3.第三阶段（2023年及之后）：完善中台服务，全面提升应用
全面迭代中台通用能力，全量应用中台服务，支撑各前端应用敏捷调用；全面建成并稳定运行智慧共享财务平台，实现虚拟共享中心、智慧运营中心、生态创新中心三个功能定位，全面落地数智化财务管理新模式；实现中台服务成熟完善、灵活迭代，智慧应用敏捷高效、响应及时；完成智慧共享财务平台运营体系优化提升，支撑财务业务高效运转、业财数据高效融合、管理要求高效支撑。''',
'''1.1.1.财务业务中台建设背景（一）抓住数字化转型发展关键契机国家层面：顺应数字经济的快速崛起，发挥数据要素的倍增效应，释放底层数据的增值潜力，挖掘新业态、新模式、新优势的蓝海空间，促进数据资源向数据资产、数据资本进化。公司层面：按照能源互联网升级要求，致力于提高数字化发展指数，聚合电网资源、客户资源、市场资源创造共同价值，推动公司财务与经营的数字化转型，在数字化新趋势中持续保持领先优势。（二）支撑“十四五”财务规划快速落地构筑“开放协同、智慧共享”的价值生态系统，实现“三开放、六协同、八精益、两赋能”，需要更完备的数字基础、更自动的应用功能、更智慧的模型算法、更广泛的内外连接，需要运用中台技术实现复用共享，需要云架构实现上下一体，需要微服务实现灵活应用，新型的以数字为灵魂的财务平台建设迫在眉睫。（三）着力解决当前系统应用面临的问题1.以“SAP+财务管控”为核心的系统基础有效支撑了集约化阶段公司统一财务管控体系的建设，但受限于部署系统较多、系统架构封闭陈旧等因素，难以有效支撑新时期财务数字化转型升级，亟需按照公司架构中台化策略，加快推进平台建设。从外部看，随着商业环境发展，传统IT架构已无法满足业务快速变化的需求，阿里、华为、中国移动等企业越来越依赖先进的IT技术提供的新产品和服务，都大力推进企业信息化架构优化升级，其中推行中台战略是主要做法。从内部看，公司高质量推进企业中台建设，推动架构中台化，已规划建成了客户服务中台、电网资源中台、项目管理中台，为前台业务提供了可复用的共享能力，支撑业务快速发展、敏捷迭代、按需调整，赋能公司电网生产、客户服务、经营管理业务创新发展。2.财务内部业务流程贯通不足，预算、核算、财税等的组织、科目、辅助维度等主数据未整合为一套体系，业务数据模型不一致，彼此衔接不畅。针对业务部门管理的购售电、工程项目等业务，财务各处室分别从专业管理角度提出信息集成需求，未建立起针对同一资源对象的统筹管理机制，管理口径不统一、信息复用程度低、数据处理功能分散，专业间协同共享不足。3.系统自动化水平不高、数据应用不足。目前信息化主要实现线下业务转线上处理，虽然在一定程度上提高了业务处理效率，但仍存在大量人工处理工作，新兴技术在财务信息化中的应用不足，系统自动化、智能化水平不高，系统用户体验亟待提升，财务人员信息化获得感不强。系统中数据不统一、不衔接，辅助决策系统功能不易用、模型构建大量依靠技术人员，系统多年应用积累的大量数据综合应用水平低，数据分析应用主动性不强、水平不高；财务操作处理类工作的自动化水平低，钳制财务人员精力，转型困难。''',
'''1.1.2. 财务业务中台总体建设目标  按照公司企业中台整体架构，遵循“降低系统复杂性、提升数据精益性、重塑整体连接性”原则，重塑财务管理数字化架构，着力解决系统繁多、专业壁垒、用户体验不佳等问题，构建“财务中台+智慧应用”的智慧共享财务平台。未来实现在这一个平台上完成所有财务工作，在这一个平台上实现全量数据集中共享，在这一个平台上实现内外互联，在这一个平台上敏捷响应新业务的不断拓展。通过智慧共享财务平台打造企业级通用服务能力和财务领域专业支撑能力，在通用服务能力方面，通过变革数据逻辑、业务逻辑、系统逻辑、管理逻辑，梳理公司经营管理全场景和价值管控全流程，提炼形成标准、规则、数据、服务四类核心元素，沉淀企业级共享能力，并在财务中台统一管理，以业务数据化支撑操作“一平台”、管理“一标准”、数据“一个池”。在专业支撑能力方面，围绕操作自动、流程高效、数据汇聚、体验优越的目标，对现有19套财务系统功能进行解耦、重构、升级，建设业务操作类应用和数据分析场景，以数据业务化提高平台灵活性和易用性。具体建设目标如下：1.建设虚拟共享中心。依托财务中台，通过构建“标准一致、规则统一、数据互联、操作智能”的虚拟共享模式，以系统核心要素资源云上共享代替人员和机器物理集中，有效保障业务操作标准化、处理规范化和响应敏捷性，重塑财务工作业态，以共享提升价值，实现各单位“接入即共享”。2.建设智慧运营中心。依托数据中台，通过统一的数据标准、统一的数据标签、统一的数据模型、统一的数据架构，全面贯通内部数据、有序连接外部数据，将分散的数据资源整合为一体化的数据资产，充分发挥数据生产要素作用，支持在线化、多场景、可视化分析应用，以数字支撑决策，实现各层级“应用即赋能”。3.建设生态创新中心。依托企业中台，通过总对总系统直连、数据标准统一、业务无纸办理等手段，实现与政府各部门、社会各主体高效共享数据信息、价值服务和发展成果，以财政部电子凭证会计数据标准深化试点为契机，进一步以数据融合带动产业链融合，实现各主体“连接即生态”。平台采用一级部署模式，全公司共用一套统一完整的标准、规则、数据、服务，在业务上实现操作流程、管理标准、风控要求全网统一，在数据上实现标准一致、质量可靠、全网汇聚，在功能上实现同质化业务统一管理、差异化需求有序响应，推动处理更加自动、响应更加敏捷、分析更加智能、决策更加智慧、生态更加活跃。'''    
    ]
    vector_db.add_documents(paragraphs,"CWZT")

